app/Controllers/API/AuthController.php

SELECT *
FROM `student`
WHERE `student_email` = 'lecturer@test.com'
 LIMIT 1
---

      // Check Students Table
      $studentModel = new StudentModel();
      $student = $studentModel->where('student_email', $email)->first();

SELECT *
FROM `parent`
WHERE `parent_email` = 'lecturer@test.com'
 LIMIT 1
---
      // Check Parents Table
      if (!$user) {
          $parentModel = new ParentModel();
          $parent = $parentModel->where('parent_email', $email)->first();

SELECT *
FROM `lecturer`
WHERE `lecturer_email` = 'lecturer@test.com'
 LIMIT 1
---
      // Check Lecturers Table
      if (!$user) {
          $lecturerModel = new LecturerModel();
          $lecturer = $lecturerModel->where('lecturer_email', $email)->first();

SELECT *
FROM `admin`
WHERE `admin_email` = 'lecturer@test.com'
 LIMIT 1
---
      // Check Admins Table
      if (!$user) {
          $adminModel = new AdminModel();
          $admin = $adminModel->where('admin_email', $email)->first();