app/Controllers/API/LecturerController.php

  public function createClass() {
    // Set headers
    $this->response->setHeader('Access-Control-Allow-Origin', '*')
                   ->setHeader('Access-Control-Allow-Methods', 'GET, POST, OPTIONS, PUT, DELETE')
                   ->setHeader('Access-Control-Allow-Headers', 'Content-Type, Authorization');

    $request = $this->request->getJSON();

    // Validate required fields
    if (!isset($request->className, $request->lecturerId)) {
        return $this->fail("Class name and lecturer ID are required", 400);
    }

    $classModel = new ClassModel();

    // Generate unique invite code
    $inviteCode = $this->generateUniqueInviteCode($classModel); // Example: 'A1B2C3'

    // Prepare class data
    $data = [
        'class_name' => $request->className,
        'class_description' => $request->description ?? null,
        'start_date' => $request->startDate ?? null,
        'end_date' => $request->endDate ?? null,
        'lecturer_id' => $request->lecturerId,
        'invite_code' => $inviteCode
    ];

    // Insert into the database
    $classId = $classModel->insert($data);
---
INSERT INTO `class` (`class_name`, `class_description`, `start_date`, `end_date`, `lecturer_id`, `invite_code`, `created_at`, `updated_at`) VALUES ('lecturer1 testing', 'checking an important feature', '2025-03-20', '2025-03-21', '1', 'C2A1C6', '2025-03-19 05:27:42', '2025-03-19 05:27:42')

    }

    // Fetch all classes created by the lecturer
    $allClasses = $classModel->where('lecturer_id', $request->lecturerId)->findAll();
---
SELECT *
FROM `class`
WHERE `lecturer_id` = '1'

  private function generateUniqueInviteCode($classModel) {
    do {
        $inviteCode = strtoupper(bin2hex(random_bytes(3))); // Example: 'A1B2C3'
        $existingCode = $classModel->where('invite_code', $inviteCode)->first();
---
SELECT *
FROM `class`
WHERE `invite_code` = 'F9D223'
 LIMIT 1

  public function getLecturerClasses() {
    $this->response->setHeader('Access-Control-Allow-Origin', '*')
                   ->setHeader('Access-Control-Allow-Methods', 'GET, POST, OPTIONS, PUT, DELETE')
                   ->setHeader('Access-Control-Allow-Headers', 'Content-Type, Authorization');

    // Get logged-in lecturer ID from session
    // $lecturerId = session()->get('lecturer_id');

    // $lecturerId = $this->request->getJSON()->lecturerId ?? null;
    $lecturerId = $this->request->getHeaderLine('X-Lecturer-ID');

    if (!$lecturerId) {
        return $this->fail("Bad Request: Lecturer ID is required", 401);
    }

    // Load Class Model
    $classModel = new ClassModel();

    // Fetch all classes for the lecturer
    $classes = $classModel->where('lecturer_id', $lecturerId)->findAll();
---
SELECT *
FROM `class`
WHERE `lecturer_id` = '1'